#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
Функция ВыполненныеСотрудникомРаботы(Сотрудник, ПериодНачало, ПериодКонец)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботы.СуммаКОплате, 0)) КАК ПроцентОтРабот,
	               |	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК ВКМ_ВыполненныеСотрудникомРаботы
	               |ГДЕ
	               |	ВКМ_ВыполненныеСотрудникомРаботы.ДатаПроведенияРабот МЕЖДУ &ПериодНачало И &ПериодКонец
	               |	И ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник = &Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ВыполненныеСотрудникомРаботы.Сотрудник";
	Запрос.УстановитьПараметр("ПериодНачало",  ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец",  ПериодКонец);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ПроцентОтРабот;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#КонецЕсли