#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Видимость = ВидДоговораПриИзмененииНаСервере(Объект.ВидДоговора);	
	Элементы.ГруппаДанныеДоговора.Видимость = Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскаяПлата Тогда
		ПроверяемыеРеквизиты.Добавить("ДействуетДо");
		ПроверяемыеРеквизиты.Добавить("СтавкаЧас");
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Видимость = ВидДоговораПриИзмененииНаСервере(Объект.ВидДоговора);
	
	Элементы.ГруппаДанныеДоговора.Видимость = Видимость;
	Объект.Дата = ОбщегоНазначенияКлиент.ДатаСеанса();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВидДоговора
&НаСервере
Функция ВидДоговораПриИзмененииНаСервере(ВидДоговора)
		
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскаяПлата Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти


