#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
Функция ОкладСуммаСреднеГодовая(ПериодНачало, Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СРЕДНЕЕ(ВКМ_ОсновоныеНачисления.Сумма) КАК СуммаОклад
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ОсновоныеНачисления КАК ВКМ_ОсновоныеНачисления
	               |ГДЕ
	               |	ВКМ_ОсновоныеНачисления.ВидРасчета = &ВидРасчета
	               |	И ВКМ_ОсновоныеНачисления.Сотрудник = &Сотрудник
	               |	И ВКМ_ОсновоныеНачисления.ПериодДействияНачало МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ПериодНачало, МЕСЯЦ, -12), МЕСЯЦ) И &ПериодНачало";
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.СуммаОклад;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#КонецЕсли