
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	ДВижения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Сотрудники;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
	Блокировка.Заблокировать();
	
	Отказ = ЗадолженностьПередРаботниками(Сотрудники);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Сотрудники Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Подразделение = Строка.Подразделение;
		ДВижение.Сумма = Строка.Сумма;
		Движение.Период = МоментВремени().Дата;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗадолженностьПередРаботниками(МассивСотрудники);
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_Док.Сотрудник КАК Сотрудник,
	               |	ВТ_Док.Сумма КАК СуммаКОплате
	               |ПОМЕСТИТЬ ВТ_Док
	               |ИЗ
	               |	&ВТ_Док КАК ВТ_Док
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	ВТ_Док.СуммаКОплате КАК СуммаКОплате
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период, Сотрудник В (&МассивСотрудники)) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Док КАК ВТ_Док
	               |		ПО ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник = ВТ_Док.Сотрудник";
	Запрос.УстановитьПараметр("МассивСотрудники", МассивСотрудники);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ВТ_Док", Сотрудники);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Если Результат.СуммаКОплате > Результат.СуммаОстаток Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("По сотруднику %1 Некорректные данные. Долг перед работником %2. Проведение невозможно",
				Результат.Сотрудник, Результат.СуммаОстаток));
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

#КонецЕсли