#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьДвижения();
	РассчитатьДопНачисления();
	РассчитатьВзаиморасчет();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	Для Каждого Строка Из Сотрудники Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		ДВижение.Сотрудник = Строка.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.Подразделение = Строка.Подразделение;
		Движение.ДопНачисление = Строка.Сумма;
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
КонецПроцедуры

Процедура РассчитатьДопНачисления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.ДопНачисление КАК ДопНачисление,
	               |	ВКМ_ДополнительныеНачисления.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления[Результат.НомерСтроки - 1];
		Движение.Сумма = Результат.ДопНачисление / 100 * 87;
		ЗаписьУдержаний(ДВижение.Сотрудник, Движение.ДопНачисление - Движение.Сумма, Перечисления.ВКМ_СпособРасчета.Премия);
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура ЗаписьУдержаний(Сотрудник, Удержание, СпособРасчета) Экспорт
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	ДВижения.ВКМ_Удержания.Записать();
	Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "Подразделение");
	Движение = Движения.ВКМ_Удержания.Добавить();
	Движение.Сотрудник = Сотрудник;
	Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	Движение.ПериодДействия = Дата;
	Движение.Подразделение = Подразделение;
	Движение.Начисление = СпособРасчета;
	Движение.Сумма = Удержание;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры


Процедура РассчитатьВзаиморасчет()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_ДополнительныеНачисления.Подразделение КАК Подразделение,
	               |	ВКМ_ДополнительныеНачисления.Сумма КАК Сумма
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		Движение.Сотрудник = Результат.Сотрудник;
		ДВижение.Подразделение = Результат.Подразделение;
		Движение.Сумма = Результат.Сумма;
		
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли
