#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьДвижения();
	
	РассчитатьВзаиморасчет();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	Движения.ВКМ_Удержания.Записывать = Истина;
	ДВижения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записать();

	Для Каждого Строка Из Сотрудники Цикл
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		ДВижение.Сотрудник = Строка.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.Подразделение = Строка.Подразделение;
		Движение.Сумма = Строка.Сумма;
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.Подразделение = Строка.Подразделение;
		Движение.Начисление = Перечисления.ВКМ_СпособРасчета.Премия;
		Движение.Сумма = Строка.НДФЛ;
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записать();
КонецПроцедуры


Процедура РассчитатьВзаиморасчет()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_ДополнительныеНачисления.Подразделение КАК Подразделение,
	               |	ВКМ_ДополнительныеНачисления.Сумма КАК СуммаПремия,
	               |	ВКМ_Удержания.Сумма КАК СуммаУдержания
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_Удержания.Сотрудник
	               |			И ВКМ_ДополнительныеНачисления.Подразделение = ВКМ_Удержания.Подразделение
	               |			И ВКМ_ДополнительныеНачисления.Регистратор = ВКМ_Удержания.Регистратор
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		Движение.Сотрудник = Результат.Сотрудник;
		ДВижение.Подразделение = Результат.Подразделение;
		Движение.Сумма = Результат.СуммаПремия - Результат.СуммаУдержания;
		Движение.Период = Дата;
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли
