#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресВрХр = Параметры.АдресВрХр;
	ТабОтпуск = ПолучитьИзВременногоХранилища(АдресВрХр);
	Для Каждого Строка Из ТабОтпуск Цикл
		Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник, "Сотрудник");
		Точка.Текст = Строка.Сотрудник;
		
		Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
	КонецЦикла

КонецПроцедуры

#КонецОбласти