#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
Функция ФормированиеКоличестваДней(ПериодНачало, ПериодКонец) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(ВКМ_ГрафикРабот.Значение / 8, 0)) КАК КоличествоДней
	               |ИЗ
	               |	РегистрСведений.ВКМ_ГрафикРабот КАК ВКМ_ГрафикРабот
	               |ГДЕ
	               |	ВКМ_ГрафикРабот.Дата МЕЖДУ &ПериодНачало И &ПериодКонец";
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", ПериодКонец);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.КоличествоДней;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("На данный период не установлен график работ",,,, Истина);
		Возврат 0;
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#КонецЕсли